Warning: DC is only available in Tcl and XG mode. The -tcl_mode and -xg_mode options are no longer required.

                           Design Compiler Graphical 
                                 DC Ultra (TM)
                                  DFTMAX (TM)
                              Power Compiler (TM)
                                 DesignWare (R)
                                 DC Expert (TM)
                               Design Vision (TM)
                               HDL Compiler (TM)
                               VHDL Compiler (TM)
                                  DFT Compiler
                               Design Compiler(R)

               Version T-2022.03-SP3 for linux64 - Jul 12, 2022 

                    Copyright (c) 1988 - 2022 Synopsys, Inc.
   This software and the associated documentation are proprietary to Synopsys,
 Inc. This software may only be used in accordance with the terms and conditions
 of a written license agreement with Synopsys, Inc. All other use, reproduction,
   or distribution of this software is strictly prohibited.  Licensed Products
     communicate with Synopsys servers for the purpose of providing software
    updates, detecting software piracy and verifying that customers are using
    Licensed Products in conformity with the applicable License Key for such
  Licensed Products. Synopsys will use information gathered in connection with
    this process to deliver software updates and pursue software pirates and
                                   infringers.

 Inclusivity & Diversity - Visit SolvNetPlus to read the "Synopsys Statement on
            Inclusivity and Diversity" (Refer to article 000036315 at
                        https://solvnetplus.synopsys.com)
Initializing...
# EECS627 Lab Final
# 8-bit multiplier with LFSR and signature analyzer
# TCL script for Design Compiler
# Load common variables, artisan standard cells
source -verbose "../common.syn.tcl"
/afs/umich.edu/class/eecs627/ibm13/artisan/current/aci/sc-x/synopsys/
/usr/caen/synopsys-synth-2022.03-SP3
. /afs/umich.edu/class/eecs627/ibm13/artisan/current/aci/sc-x/synopsys/ /usr/caen/synopsys-synth-2022.03-SP3/libraries/syn
* typical.db dw_foundation.sldb
typical.db
Loading db file '/afs/umich.edu/class/eecs627/ibm13/artisan/current/aci/sc-x/synopsys/typical.db'
Loading db file '/usr/caen/synopsys-synth-2022.03-SP3/libraries/syn/dw_foundation.sldb'
1
1
# Set top level name
set top_level "decoder"
decoder
# Read verilog files
read_file -f sverilog [list "../../../sys_defs.svh" "../../verilog/decoder.v"]
Loading db file '/usr/caen/synopsys-synth-2022.03-SP3/libraries/syn/gtech.db'
Loading db file '/usr/caen/synopsys-synth-2022.03-SP3/libraries/syn/standard.sldb'
  Loading link library 'gtech'
Loading sverilog files: '/afs/umich.edu/class/eecs627/w23/groups/group4/CNN_LSTM/sys_defs.svh' '/afs/umich.edu/class/eecs627/w23/groups/group4/CNN_LSTM/CNN_POOL_ReLU/verilog/decoder.v' 
Detecting input file type automatically (-rtl or -netlist).
Reading with Presto HDL Compiler (equivalent to -rtl option).
Running PRESTO HDLC
Compiling source file /afs/umich.edu/class/eecs627/w23/groups/group4/CNN_LSTM/sys_defs.svh
Compiling source file /afs/umich.edu/class/eecs627/w23/groups/group4/CNN_LSTM/CNN_POOL_ReLU/verilog/decoder.v
Error:  /afs/umich.edu/class/eecs627/w23/groups/group4/CNN_LSTM/CNN_POOL_ReLU/verilog/decoder.v:39: Variable 'CNN_pk_out' is the target of both blocking and nonblocking assignments in the same always block. (VER-134)
*** Presto compilation terminated with 1 errors. ***
Error: Can't read 'sverilog' files '/afs/umich.edu/class/eecs627/w23/groups/group4/CNN_LSTM/sys_defs.svh', '/afs/umich.edu/class/eecs627/w23/groups/group4/CNN_LSTM/CNN_POOL_ReLU/verilog/decoder.v'. (UID-9)
No designs were read
list_designs
Warning: No designs to list. (UID-275)
0
current_design $top_level
Error: Can't find design 'decoder'. (UID-109)
Error: Current design is not defined. (UID-4)
# Clock period
set clk_period 1.0
1.0
set clk_uncertainty 0.1
0.1
set clk_transition 0.1
0.1
#Create real clock if clock port is found
if {[sizeof_collection [get_ports clk]] > 0} {
  set clk_name "clk"
  set clk_port "clk"
  #If no waveform is specified, 50% duty cycle is assumed
  create_clock -name $clk_name -period $clk_period [get_ports $clk_port] 
  set_drive 0 [get_clocks $clk_name] 
}
Error: Current design is not defined. (UID-4)
Error: Can't find port 'clk'. (UID-109)
set_clock_uncertainty $clk_uncertainty [get_clocks $clk_name]
Error: can't read "clk_name": no such variable
	Use error_info for more info. (CMD-013)
#Propagated clock used for gated clocks only
#set_propagated_clock [get_clocks $clk_name]
set_clock_transition $clk_transition [get_clocks $clk_name]
Error: can't read "clk_name": no such variable
	Use error_info for more info. (CMD-013)
set_operating_conditions "typical" -library "typical" 
Error: Current design is not defined. (UID-4)
0
set_wire_load_model -name "ibm13_wl10" -library "typical" 
Error: Current design is not defined. (UID-4)
0
set_wire_load_mode "segmented" 
Error: Current design is not defined. (UID-4)
0
set typical_input_delay 0.100
0.100
set typical_output_delay 0.100
0.100
set typical_wire_load 0.010 
0.010
# Set leakage optimization
set_leakage_optimization true
Error: Current design is not defined. (UID-4)
1
# Set maximum fanout of gates
set_max_fanout 16 $top_level 
Error: Current design is not defined. (UID-4)
Error: Can't find object 'decoder'. (UID-109)
Error: Value for list 'object_list' must have 1 elements. (CMD-036)
0
# Configure the clock network
set_fix_hold [all_clocks] 
Error: Current design is not defined. (UID-4)
Error: Value for list '<clock_list>' must have 1 elements. (CMD-036)
0
set_dont_touch_network $clk_port 
Error: can't read "clk_port": no such variable
	Use error_info for more info. (CMD-013)
# Set delays: Input, Output
set_driving_cell -lib_cell INVX2TR [all_inputs]
Error: Current design is not defined. (UID-4)
Error: Value for list 'port_list' must have 1 elements. (CMD-036)
0
set_input_delay $typical_input_delay [all_inputs] -clock $clk_name 
Error: Current design is not defined. (UID-4)
Error: can't read "clk_name": no such variable
	Use error_info for more info. (CMD-013)
remove_input_delay -clock $clk_name [find port $clk_port]
Error: can't read "clk_name": no such variable
	Use error_info for more info. (CMD-013)
set_output_delay $typical_output_delay [all_outputs] -clock $clk_name 
Error: Current design is not defined. (UID-4)
Error: can't read "clk_name": no such variable
	Use error_info for more info. (CMD-013)
# Set loading of outputs 
set_load $typical_wire_load [all_outputs] 
Error: Current design is not defined. (UID-4)
Error: Value for list 'objects' must have 1 elements. (CMD-036)
0
# Link the design
link
Error: Current design is not defined. (UID-4)
0
# Verify the design
check_design
Error: Current design is not defined. (UID-4)
0
uniquify
Error: Current design is not defined. (UID-4)
0
# Synthesize the design with retiming (not necessary for your design if you don't want/need it.)
set_optimize_registers
Error: Current design is not defined. (UID-4)
0
compile_ultra
Error: Current design is not defined. (UID-4)
0
compile_ultra -incremental
Error: Current design is not defined. (UID-4)
0
# Rename modules, signals according to the naming rules Used for tool exchange
source -verbose "../naming_rules.syn.tcl"
1
Error: Current design is not defined. (UID-4)
0
0
# Generate structural verilog netlist
write -hierarchy -format verilog -output "./data/${top_level}.syn.v"
Error: No files or designs were specified. (UID-22)
0
# Generate Standard Delay Format (SDF) file
write_sdf -context verilog "./data/${top_level}.syn.sdf"
Error: Current design is not defined. (UID-4)
0
# Generate timing constraints file
write_sdc "./data/${top_level}.syn.sdc"
Error: Current design is not defined. (UID-4)
0
# Generate report file
set maxpaths 20
20
set rpt_file "./report/${top_level}.syn.rpt"
./report/decoder.syn.rpt
check_design > $rpt_file
report_area  >> ${rpt_file}
report_power -hier -analysis_effort medium >> ${rpt_file}
report_design >> ${rpt_file}
report_cell >> ${rpt_file}
report_port -verbose >> ${rpt_file}
report_compile_options >> ${rpt_file}
report_constraint -all_violators -verbose >> ${rpt_file}
report_timing -path full -delay max -max_paths $maxpaths -nworst 100 >> ${rpt_file}
# Exit dc_shell
quit

Memory usage for this session 151 Mbytes.
Memory usage for this session including child processes 151 Mbytes.
CPU usage for this session 3 seconds ( 0.00 hours ).
Elapsed time for this session 5 seconds ( 0.00 hours ).

Thank you...
