###################################################################

# Created by write_sdc on Sun Apr  2 18:33:38 2023

###################################################################
set sdc_version 2.1

set_units -time ns -resistance kOhm -capacitance pF -voltage V -current mA
set_operating_conditions typical -library typical
set_wire_load_mode segmented
set_wire_load_model -name ibm13_wl10 -library typical
set_driving_cell -lib_cell INVX2TR [get_ports clk]
set_driving_cell -lib_cell INVX2TR [get_ports reset]
set_load -pin_load 0.01 [get_ports wrb]
set_load -pin_load 0.01 [get_ports {PE_state[2]}]
set_load -pin_load 0.01 [get_ports {PE_state[1]}]
set_load -pin_load 0.01 [get_ports {PE_state[0]}]
set_load -pin_load 0.01 [get_ports {wrb_addr[7]}]
set_load -pin_load 0.01 [get_ports {wrb_addr[6]}]
set_load -pin_load 0.01 [get_ports {wrb_addr[5]}]
set_load -pin_load 0.01 [get_ports {wrb_addr[4]}]
set_load -pin_load 0.01 [get_ports {wrb_addr[3]}]
set_load -pin_load 0.01 [get_ports {wrb_addr[2]}]
set_load -pin_load 0.01 [get_ports {wrb_addr[1]}]
set_load -pin_load 0.01 [get_ports {wrb_addr[0]}]
set_load -pin_load 0.01 [get_ports {rdB_addr[3]}]
set_load -pin_load 0.01 [get_ports {rdB_addr[2]}]
set_load -pin_load 0.01 [get_ports {rdB_addr[1]}]
set_load -pin_load 0.01 [get_ports {rdB_addr[0]}]
set_load -pin_load 0.01 [get_ports {mem_addr[12]}]
set_load -pin_load 0.01 [get_ports {mem_addr[11]}]
set_load -pin_load 0.01 [get_ports {mem_addr[10]}]
set_load -pin_load 0.01 [get_ports {mem_addr[9]}]
set_load -pin_load 0.01 [get_ports {mem_addr[8]}]
set_load -pin_load 0.01 [get_ports {mem_addr[7]}]
set_load -pin_load 0.01 [get_ports {mem_addr[6]}]
set_load -pin_load 0.01 [get_ports {mem_addr[5]}]
set_load -pin_load 0.01 [get_ports {mem_addr[4]}]
set_load -pin_load 0.01 [get_ports {mem_addr[3]}]
set_load -pin_load 0.01 [get_ports {mem_addr[2]}]
set_load -pin_load 0.01 [get_ports {mem_addr[1]}]
set_load -pin_load 0.01 [get_ports {mem_addr[0]}]
set_load -pin_load 0.01 [get_ports {SRAM_in_A_addr[9]}]
set_load -pin_load 0.01 [get_ports {SRAM_in_A_addr[8]}]
set_load -pin_load 0.01 [get_ports {SRAM_in_A_addr[7]}]
set_load -pin_load 0.01 [get_ports {SRAM_in_A_addr[6]}]
set_load -pin_load 0.01 [get_ports {SRAM_in_A_addr[5]}]
set_load -pin_load 0.01 [get_ports {SRAM_in_A_addr[4]}]
set_load -pin_load 0.01 [get_ports {SRAM_in_A_addr[3]}]
set_load -pin_load 0.01 [get_ports {SRAM_in_A_addr[2]}]
set_load -pin_load 0.01 [get_ports {SRAM_in_A_addr[1]}]
set_load -pin_load 0.01 [get_ports {SRAM_in_A_addr[0]}]
set_load -pin_load 0.01 [get_ports {SRAM_in_B_addr[9]}]
set_load -pin_load 0.01 [get_ports {SRAM_in_B_addr[8]}]
set_load -pin_load 0.01 [get_ports {SRAM_in_B_addr[7]}]
set_load -pin_load 0.01 [get_ports {SRAM_in_B_addr[6]}]
set_load -pin_load 0.01 [get_ports {SRAM_in_B_addr[5]}]
set_load -pin_load 0.01 [get_ports {SRAM_in_B_addr[4]}]
set_load -pin_load 0.01 [get_ports {SRAM_in_B_addr[3]}]
set_load -pin_load 0.01 [get_ports {SRAM_in_B_addr[2]}]
set_load -pin_load 0.01 [get_ports {SRAM_in_B_addr[1]}]
set_load -pin_load 0.01 [get_ports {SRAM_in_B_addr[0]}]
set_load -pin_load 0.01 [get_ports SRAM_WENB1]
set_load -pin_load 0.01 [get_ports SRAM_WENB2]
set_load -pin_load 0.01 [get_ports SRAM_WENB3]
set_load -pin_load 0.01 [get_ports SRAM_WENB4]
create_clock [get_ports clk]  -period 1.5  -waveform {0 0.75}
set_clock_uncertainty 0.1  [get_clocks clk]
set_clock_transition -min -fall 0.1 [get_clocks clk]
set_clock_transition -min -rise 0.1 [get_clocks clk]
set_clock_transition -max -fall 0.1 [get_clocks clk]
set_clock_transition -max -rise 0.1 [get_clocks clk]
set_input_delay -clock clk  0.1  [get_ports reset]
set_output_delay -clock clk  0.1  [get_ports wrb]
set_output_delay -clock clk  0.1  [get_ports {PE_state[2]}]
set_output_delay -clock clk  0.1  [get_ports {PE_state[1]}]
set_output_delay -clock clk  0.1  [get_ports {PE_state[0]}]
set_output_delay -clock clk  0.1  [get_ports {wrb_addr[7]}]
set_output_delay -clock clk  0.1  [get_ports {wrb_addr[6]}]
set_output_delay -clock clk  0.1  [get_ports {wrb_addr[5]}]
set_output_delay -clock clk  0.1  [get_ports {wrb_addr[4]}]
set_output_delay -clock clk  0.1  [get_ports {wrb_addr[3]}]
set_output_delay -clock clk  0.1  [get_ports {wrb_addr[2]}]
set_output_delay -clock clk  0.1  [get_ports {wrb_addr[1]}]
set_output_delay -clock clk  0.1  [get_ports {wrb_addr[0]}]
set_output_delay -clock clk  0.1  [get_ports {rdB_addr[3]}]
set_output_delay -clock clk  0.1  [get_ports {rdB_addr[2]}]
set_output_delay -clock clk  0.1  [get_ports {rdB_addr[1]}]
set_output_delay -clock clk  0.1  [get_ports {rdB_addr[0]}]
set_output_delay -clock clk  0.1  [get_ports {mem_addr[12]}]
set_output_delay -clock clk  0.1  [get_ports {mem_addr[11]}]
set_output_delay -clock clk  0.1  [get_ports {mem_addr[10]}]
set_output_delay -clock clk  0.1  [get_ports {mem_addr[9]}]
set_output_delay -clock clk  0.1  [get_ports {mem_addr[8]}]
set_output_delay -clock clk  0.1  [get_ports {mem_addr[7]}]
set_output_delay -clock clk  0.1  [get_ports {mem_addr[6]}]
set_output_delay -clock clk  0.1  [get_ports {mem_addr[5]}]
set_output_delay -clock clk  0.1  [get_ports {mem_addr[4]}]
set_output_delay -clock clk  0.1  [get_ports {mem_addr[3]}]
set_output_delay -clock clk  0.1  [get_ports {mem_addr[2]}]
set_output_delay -clock clk  0.1  [get_ports {mem_addr[1]}]
set_output_delay -clock clk  0.1  [get_ports {mem_addr[0]}]
set_output_delay -clock clk  0.1  [get_ports {SRAM_in_A_addr[9]}]
set_output_delay -clock clk  0.1  [get_ports {SRAM_in_A_addr[8]}]
set_output_delay -clock clk  0.1  [get_ports {SRAM_in_A_addr[7]}]
set_output_delay -clock clk  0.1  [get_ports {SRAM_in_A_addr[6]}]
set_output_delay -clock clk  0.1  [get_ports {SRAM_in_A_addr[5]}]
set_output_delay -clock clk  0.1  [get_ports {SRAM_in_A_addr[4]}]
set_output_delay -clock clk  0.1  [get_ports {SRAM_in_A_addr[3]}]
set_output_delay -clock clk  0.1  [get_ports {SRAM_in_A_addr[2]}]
set_output_delay -clock clk  0.1  [get_ports {SRAM_in_A_addr[1]}]
set_output_delay -clock clk  0.1  [get_ports {SRAM_in_A_addr[0]}]
set_output_delay -clock clk  0.1  [get_ports {SRAM_in_B_addr[9]}]
set_output_delay -clock clk  0.1  [get_ports {SRAM_in_B_addr[8]}]
set_output_delay -clock clk  0.1  [get_ports {SRAM_in_B_addr[7]}]
set_output_delay -clock clk  0.1  [get_ports {SRAM_in_B_addr[6]}]
set_output_delay -clock clk  0.1  [get_ports {SRAM_in_B_addr[5]}]
set_output_delay -clock clk  0.1  [get_ports {SRAM_in_B_addr[4]}]
set_output_delay -clock clk  0.1  [get_ports {SRAM_in_B_addr[3]}]
set_output_delay -clock clk  0.1  [get_ports {SRAM_in_B_addr[2]}]
set_output_delay -clock clk  0.1  [get_ports {SRAM_in_B_addr[1]}]
set_output_delay -clock clk  0.1  [get_ports {SRAM_in_B_addr[0]}]
set_output_delay -clock clk  0.1  [get_ports SRAM_WENB1]
set_output_delay -clock clk  0.1  [get_ports SRAM_WENB2]
set_output_delay -clock clk  0.1  [get_ports SRAM_WENB3]
set_output_delay -clock clk  0.1  [get_ports SRAM_WENB4]
