###################################################################

# Created by write_sdc on Sat Mar 26 17:36:22 2022

###################################################################
set sdc_version 2.0

set_units -time ns -resistance kOhm -capacitance pF -voltage V -current mA
set_operating_conditions typical -library typical
set_wire_load_mode segmented
set_wire_load_model -name ibm13_wl10 -library typical
set_max_fanout 16 [current_design]
set_load -pin_load 0.2 [get_ports {o_smem_rdata[15]}]
set_load -pin_load 0.2 [get_ports {o_smem_rdata[14]}]
set_load -pin_load 0.2 [get_ports {o_smem_rdata[13]}]
set_load -pin_load 0.2 [get_ports {o_smem_rdata[12]}]
set_load -pin_load 0.2 [get_ports {o_smem_rdata[11]}]
set_load -pin_load 0.2 [get_ports {o_smem_rdata[10]}]
set_load -pin_load 0.2 [get_ports {o_smem_rdata[9]}]
set_load -pin_load 0.2 [get_ports {o_smem_rdata[8]}]
set_load -pin_load 0.2 [get_ports {o_smem_rdata[7]}]
set_load -pin_load 0.2 [get_ports {o_smem_rdata[6]}]
set_load -pin_load 0.2 [get_ports {o_smem_rdata[5]}]
set_load -pin_load 0.2 [get_ports {o_smem_rdata[4]}]
set_load -pin_load 0.2 [get_ports {o_smem_rdata[3]}]
set_load -pin_load 0.2 [get_ports {o_smem_rdata[2]}]
set_load -pin_load 0.2 [get_ports {o_smem_rdata[1]}]
set_load -pin_load 0.2 [get_ports {o_smem_rdata[0]}]
create_clock [get_ports i_clk]  -period 10  -waveform {0 5}
set_clock_uncertainty 0.2  [get_clocks i_clk]
set_clock_transition -max -rise 0.1 [get_clocks i_clk]
set_clock_transition -max -fall 0.1 [get_clocks i_clk]
set_clock_transition -min -rise 0.1 [get_clocks i_clk]
set_clock_transition -min -fall 0.1 [get_clocks i_clk]
set_input_delay -clock i_clk  1  [get_ports i_reset]
set_input_delay -clock i_clk  1  [get_ports i_smem_ext]
set_input_delay -clock i_clk  1  [get_ports i_smem_cen]
set_input_delay -clock i_clk  1  [get_ports i_smem_wen]
set_input_delay -clock i_clk  1  [get_ports {i_smem_addr[11]}]
set_input_delay -clock i_clk  1  [get_ports {i_smem_addr[10]}]
set_input_delay -clock i_clk  1  [get_ports {i_smem_addr[9]}]
set_input_delay -clock i_clk  1  [get_ports {i_smem_addr[8]}]
set_input_delay -clock i_clk  1  [get_ports {i_smem_addr[7]}]
set_input_delay -clock i_clk  1  [get_ports {i_smem_addr[6]}]
set_input_delay -clock i_clk  1  [get_ports {i_smem_addr[5]}]
set_input_delay -clock i_clk  1  [get_ports {i_smem_addr[4]}]
set_input_delay -clock i_clk  1  [get_ports {i_smem_addr[3]}]
set_input_delay -clock i_clk  1  [get_ports {i_smem_addr[2]}]
set_input_delay -clock i_clk  1  [get_ports {i_smem_addr[1]}]
set_input_delay -clock i_clk  1  [get_ports {i_smem_addr[0]}]
set_input_delay -clock i_clk  1  [get_ports {i_smem_wdata[15]}]
set_input_delay -clock i_clk  1  [get_ports {i_smem_wdata[14]}]
set_input_delay -clock i_clk  1  [get_ports {i_smem_wdata[13]}]
set_input_delay -clock i_clk  1  [get_ports {i_smem_wdata[12]}]
set_input_delay -clock i_clk  1  [get_ports {i_smem_wdata[11]}]
set_input_delay -clock i_clk  1  [get_ports {i_smem_wdata[10]}]
set_input_delay -clock i_clk  1  [get_ports {i_smem_wdata[9]}]
set_input_delay -clock i_clk  1  [get_ports {i_smem_wdata[8]}]
set_input_delay -clock i_clk  1  [get_ports {i_smem_wdata[7]}]
set_input_delay -clock i_clk  1  [get_ports {i_smem_wdata[6]}]
set_input_delay -clock i_clk  1  [get_ports {i_smem_wdata[5]}]
set_input_delay -clock i_clk  1  [get_ports {i_smem_wdata[4]}]
set_input_delay -clock i_clk  1  [get_ports {i_smem_wdata[3]}]
set_input_delay -clock i_clk  1  [get_ports {i_smem_wdata[2]}]
set_input_delay -clock i_clk  1  [get_ports {i_smem_wdata[1]}]
set_input_delay -clock i_clk  1  [get_ports {i_smem_wdata[0]}]
set_output_delay -clock i_clk  1  [get_ports {o_smem_rdata[15]}]
set_output_delay -clock i_clk  1  [get_ports {o_smem_rdata[14]}]
set_output_delay -clock i_clk  1  [get_ports {o_smem_rdata[13]}]
set_output_delay -clock i_clk  1  [get_ports {o_smem_rdata[12]}]
set_output_delay -clock i_clk  1  [get_ports {o_smem_rdata[11]}]
set_output_delay -clock i_clk  1  [get_ports {o_smem_rdata[10]}]
set_output_delay -clock i_clk  1  [get_ports {o_smem_rdata[9]}]
set_output_delay -clock i_clk  1  [get_ports {o_smem_rdata[8]}]
set_output_delay -clock i_clk  1  [get_ports {o_smem_rdata[7]}]
set_output_delay -clock i_clk  1  [get_ports {o_smem_rdata[6]}]
set_output_delay -clock i_clk  1  [get_ports {o_smem_rdata[5]}]
set_output_delay -clock i_clk  1  [get_ports {o_smem_rdata[4]}]
set_output_delay -clock i_clk  1  [get_ports {o_smem_rdata[3]}]
set_output_delay -clock i_clk  1  [get_ports {o_smem_rdata[2]}]
set_output_delay -clock i_clk  1  [get_ports {o_smem_rdata[1]}]
set_output_delay -clock i_clk  1  [get_ports {o_smem_rdata[0]}]
