###################################################################

# Created by write_sdc on Sun Mar 26 21:32:26 2023

###################################################################
set sdc_version 2.1

set_units -time ns -resistance kOhm -capacitance pF -voltage V -current mA
set_operating_conditions typical -library typical
set_wire_load_mode segmented
set_wire_load_model -name ibm13_wl10 -library typical
set_max_fanout 16 [current_design]
set_driving_cell -lib_cell INVX2TR [get_ports clk]
set_driving_cell -lib_cell INVX2TR [get_ports reset]
set_driving_cell -lib_cell INVX2TR [get_ports CNTR_pk_in_PE_state__2_]
set_driving_cell -lib_cell INVX2TR [get_ports CNTR_pk_in_PE_state__1_]
set_driving_cell -lib_cell INVX2TR [get_ports CNTR_pk_in_PE_state__0_]
set_driving_cell -lib_cell INVX2TR [get_ports CNTR_pk_in_wrb_data__7_]
set_driving_cell -lib_cell INVX2TR [get_ports CNTR_pk_in_wrb_data__6_]
set_driving_cell -lib_cell INVX2TR [get_ports CNTR_pk_in_wrb_data__5_]
set_driving_cell -lib_cell INVX2TR [get_ports CNTR_pk_in_wrb_data__4_]
set_driving_cell -lib_cell INVX2TR [get_ports CNTR_pk_in_wrb_data__3_]
set_driving_cell -lib_cell INVX2TR [get_ports CNTR_pk_in_wrb_data__2_]
set_driving_cell -lib_cell INVX2TR [get_ports CNTR_pk_in_wrb_data__1_]
set_driving_cell -lib_cell INVX2TR [get_ports CNTR_pk_in_wrb_data__0_]
set_driving_cell -lib_cell INVX2TR [get_ports CNTR_pk_in_wrb_addr__7_]
set_driving_cell -lib_cell INVX2TR [get_ports CNTR_pk_in_wrb_addr__6_]
set_driving_cell -lib_cell INVX2TR [get_ports CNTR_pk_in_wrb_addr__5_]
set_driving_cell -lib_cell INVX2TR [get_ports CNTR_pk_in_wrb_addr__4_]
set_driving_cell -lib_cell INVX2TR [get_ports CNTR_pk_in_wrb_addr__3_]
set_driving_cell -lib_cell INVX2TR [get_ports CNTR_pk_in_wrb_addr__2_]
set_driving_cell -lib_cell INVX2TR [get_ports CNTR_pk_in_wrb_addr__1_]
set_driving_cell -lib_cell INVX2TR [get_ports CNTR_pk_in_wrb_addr__0_]
set_driving_cell -lib_cell INVX2TR [get_ports CNTR_pk_in_wrb_]
set_driving_cell -lib_cell INVX2TR [get_ports CNTR_pk_in_rdb_addr__3_]
set_driving_cell -lib_cell INVX2TR [get_ports CNTR_pk_in_rdb_addr__2_]
set_driving_cell -lib_cell INVX2TR [get_ports CNTR_pk_in_rdb_addr__1_]
set_driving_cell -lib_cell INVX2TR [get_ports CNTR_pk_in_rdb_addr__0_]
set_load -pin_load 0.01 [get_ports CNN_pk_out_3__PE_state__2_]
set_load -pin_load 0.01 [get_ports CNN_pk_out_3__PE_state__1_]
set_load -pin_load 0.01 [get_ports CNN_pk_out_3__PE_state__0_]
set_load -pin_load 0.01 [get_ports CNN_pk_out_3__wrb_data__7_]
set_load -pin_load 0.01 [get_ports CNN_pk_out_3__wrb_data__6_]
set_load -pin_load 0.01 [get_ports CNN_pk_out_3__wrb_data__5_]
set_load -pin_load 0.01 [get_ports CNN_pk_out_3__wrb_data__4_]
set_load -pin_load 0.01 [get_ports CNN_pk_out_3__wrb_data__3_]
set_load -pin_load 0.01 [get_ports CNN_pk_out_3__wrb_data__2_]
set_load -pin_load 0.01 [get_ports CNN_pk_out_3__wrb_data__1_]
set_load -pin_load 0.01 [get_ports CNN_pk_out_3__wrb_data__0_]
set_load -pin_load 0.01 [get_ports CNN_pk_out_3__wrb_addr__3_]
set_load -pin_load 0.01 [get_ports CNN_pk_out_3__wrb_addr__2_]
set_load -pin_load 0.01 [get_ports CNN_pk_out_3__wrb_addr__1_]
set_load -pin_load 0.01 [get_ports CNN_pk_out_3__wrb_addr__0_]
set_load -pin_load 0.01 [get_ports CNN_pk_out_3__wrb__3_]
set_load -pin_load 0.01 [get_ports CNN_pk_out_3__wrb__2_]
set_load -pin_load 0.01 [get_ports CNN_pk_out_3__wrb__1_]
set_load -pin_load 0.01 [get_ports CNN_pk_out_3__wrb__0_]
set_load -pin_load 0.01 [get_ports CNN_pk_out_3__rdb_addr__3_]
set_load -pin_load 0.01 [get_ports CNN_pk_out_3__rdb_addr__2_]
set_load -pin_load 0.01 [get_ports CNN_pk_out_3__rdb_addr__1_]
set_load -pin_load 0.01 [get_ports CNN_pk_out_3__rdb_addr__0_]
set_load -pin_load 0.01 [get_ports CNN_pk_out_2__PE_state__2_]
set_load -pin_load 0.01 [get_ports CNN_pk_out_2__PE_state__1_]
set_load -pin_load 0.01 [get_ports CNN_pk_out_2__PE_state__0_]
set_load -pin_load 0.01 [get_ports CNN_pk_out_2__wrb_data__7_]
set_load -pin_load 0.01 [get_ports CNN_pk_out_2__wrb_data__6_]
set_load -pin_load 0.01 [get_ports CNN_pk_out_2__wrb_data__5_]
set_load -pin_load 0.01 [get_ports CNN_pk_out_2__wrb_data__4_]
set_load -pin_load 0.01 [get_ports CNN_pk_out_2__wrb_data__3_]
set_load -pin_load 0.01 [get_ports CNN_pk_out_2__wrb_data__2_]
set_load -pin_load 0.01 [get_ports CNN_pk_out_2__wrb_data__1_]
set_load -pin_load 0.01 [get_ports CNN_pk_out_2__wrb_data__0_]
set_load -pin_load 0.01 [get_ports CNN_pk_out_2__wrb_addr__3_]
set_load -pin_load 0.01 [get_ports CNN_pk_out_2__wrb_addr__2_]
set_load -pin_load 0.01 [get_ports CNN_pk_out_2__wrb_addr__1_]
set_load -pin_load 0.01 [get_ports CNN_pk_out_2__wrb_addr__0_]
set_load -pin_load 0.01 [get_ports CNN_pk_out_2__wrb__3_]
set_load -pin_load 0.01 [get_ports CNN_pk_out_2__wrb__2_]
set_load -pin_load 0.01 [get_ports CNN_pk_out_2__wrb__1_]
set_load -pin_load 0.01 [get_ports CNN_pk_out_2__wrb__0_]
set_load -pin_load 0.01 [get_ports CNN_pk_out_2__rdb_addr__3_]
set_load -pin_load 0.01 [get_ports CNN_pk_out_2__rdb_addr__2_]
set_load -pin_load 0.01 [get_ports CNN_pk_out_2__rdb_addr__1_]
set_load -pin_load 0.01 [get_ports CNN_pk_out_2__rdb_addr__0_]
set_load -pin_load 0.01 [get_ports CNN_pk_out_1__PE_state__2_]
set_load -pin_load 0.01 [get_ports CNN_pk_out_1__PE_state__1_]
set_load -pin_load 0.01 [get_ports CNN_pk_out_1__PE_state__0_]
set_load -pin_load 0.01 [get_ports CNN_pk_out_1__wrb_data__7_]
set_load -pin_load 0.01 [get_ports CNN_pk_out_1__wrb_data__6_]
set_load -pin_load 0.01 [get_ports CNN_pk_out_1__wrb_data__5_]
set_load -pin_load 0.01 [get_ports CNN_pk_out_1__wrb_data__4_]
set_load -pin_load 0.01 [get_ports CNN_pk_out_1__wrb_data__3_]
set_load -pin_load 0.01 [get_ports CNN_pk_out_1__wrb_data__2_]
set_load -pin_load 0.01 [get_ports CNN_pk_out_1__wrb_data__1_]
set_load -pin_load 0.01 [get_ports CNN_pk_out_1__wrb_data__0_]
set_load -pin_load 0.01 [get_ports CNN_pk_out_1__wrb_addr__3_]
set_load -pin_load 0.01 [get_ports CNN_pk_out_1__wrb_addr__2_]
set_load -pin_load 0.01 [get_ports CNN_pk_out_1__wrb_addr__1_]
set_load -pin_load 0.01 [get_ports CNN_pk_out_1__wrb_addr__0_]
set_load -pin_load 0.01 [get_ports CNN_pk_out_1__wrb__3_]
set_load -pin_load 0.01 [get_ports CNN_pk_out_1__wrb__2_]
set_load -pin_load 0.01 [get_ports CNN_pk_out_1__wrb__1_]
set_load -pin_load 0.01 [get_ports CNN_pk_out_1__wrb__0_]
set_load -pin_load 0.01 [get_ports CNN_pk_out_1__rdb_addr__3_]
set_load -pin_load 0.01 [get_ports CNN_pk_out_1__rdb_addr__2_]
set_load -pin_load 0.01 [get_ports CNN_pk_out_1__rdb_addr__1_]
set_load -pin_load 0.01 [get_ports CNN_pk_out_1__rdb_addr__0_]
set_load -pin_load 0.01 [get_ports CNN_pk_out_0__PE_state__2_]
set_load -pin_load 0.01 [get_ports CNN_pk_out_0__PE_state__1_]
set_load -pin_load 0.01 [get_ports CNN_pk_out_0__PE_state__0_]
set_load -pin_load 0.01 [get_ports CNN_pk_out_0__wrb_data__7_]
set_load -pin_load 0.01 [get_ports CNN_pk_out_0__wrb_data__6_]
set_load -pin_load 0.01 [get_ports CNN_pk_out_0__wrb_data__5_]
set_load -pin_load 0.01 [get_ports CNN_pk_out_0__wrb_data__4_]
set_load -pin_load 0.01 [get_ports CNN_pk_out_0__wrb_data__3_]
set_load -pin_load 0.01 [get_ports CNN_pk_out_0__wrb_data__2_]
set_load -pin_load 0.01 [get_ports CNN_pk_out_0__wrb_data__1_]
set_load -pin_load 0.01 [get_ports CNN_pk_out_0__wrb_data__0_]
set_load -pin_load 0.01 [get_ports CNN_pk_out_0__wrb_addr__3_]
set_load -pin_load 0.01 [get_ports CNN_pk_out_0__wrb_addr__2_]
set_load -pin_load 0.01 [get_ports CNN_pk_out_0__wrb_addr__1_]
set_load -pin_load 0.01 [get_ports CNN_pk_out_0__wrb_addr__0_]
set_load -pin_load 0.01 [get_ports CNN_pk_out_0__wrb__3_]
set_load -pin_load 0.01 [get_ports CNN_pk_out_0__wrb__2_]
set_load -pin_load 0.01 [get_ports CNN_pk_out_0__wrb__1_]
set_load -pin_load 0.01 [get_ports CNN_pk_out_0__wrb__0_]
set_load -pin_load 0.01 [get_ports CNN_pk_out_0__rdb_addr__3_]
set_load -pin_load 0.01 [get_ports CNN_pk_out_0__rdb_addr__2_]
set_load -pin_load 0.01 [get_ports CNN_pk_out_0__rdb_addr__1_]
set_load -pin_load 0.01 [get_ports CNN_pk_out_0__rdb_addr__0_]
create_clock [get_ports clk]  -period 1.5  -waveform {0 0.75}
set_clock_uncertainty 0.1  [get_clocks clk]
set_clock_transition -min -fall 0.1 [get_clocks clk]
set_clock_transition -min -rise 0.1 [get_clocks clk]
set_clock_transition -max -fall 0.1 [get_clocks clk]
set_clock_transition -max -rise 0.1 [get_clocks clk]
set_input_delay -clock clk  0.1  [get_ports reset]
set_input_delay -clock clk  0.1  [get_ports CNTR_pk_in_PE_state__2_]
set_input_delay -clock clk  0.1  [get_ports CNTR_pk_in_PE_state__1_]
set_input_delay -clock clk  0.1  [get_ports CNTR_pk_in_PE_state__0_]
set_input_delay -clock clk  0.1  [get_ports CNTR_pk_in_wrb_data__7_]
set_input_delay -clock clk  0.1  [get_ports CNTR_pk_in_wrb_data__6_]
set_input_delay -clock clk  0.1  [get_ports CNTR_pk_in_wrb_data__5_]
set_input_delay -clock clk  0.1  [get_ports CNTR_pk_in_wrb_data__4_]
set_input_delay -clock clk  0.1  [get_ports CNTR_pk_in_wrb_data__3_]
set_input_delay -clock clk  0.1  [get_ports CNTR_pk_in_wrb_data__2_]
set_input_delay -clock clk  0.1  [get_ports CNTR_pk_in_wrb_data__1_]
set_input_delay -clock clk  0.1  [get_ports CNTR_pk_in_wrb_data__0_]
set_input_delay -clock clk  0.1  [get_ports CNTR_pk_in_wrb_addr__7_]
set_input_delay -clock clk  0.1  [get_ports CNTR_pk_in_wrb_addr__6_]
set_input_delay -clock clk  0.1  [get_ports CNTR_pk_in_wrb_addr__5_]
set_input_delay -clock clk  0.1  [get_ports CNTR_pk_in_wrb_addr__4_]
set_input_delay -clock clk  0.1  [get_ports CNTR_pk_in_wrb_addr__3_]
set_input_delay -clock clk  0.1  [get_ports CNTR_pk_in_wrb_addr__2_]
set_input_delay -clock clk  0.1  [get_ports CNTR_pk_in_wrb_addr__1_]
set_input_delay -clock clk  0.1  [get_ports CNTR_pk_in_wrb_addr__0_]
set_input_delay -clock clk  0.1  [get_ports CNTR_pk_in_wrb_]
set_input_delay -clock clk  0.1  [get_ports CNTR_pk_in_rdb_addr__3_]
set_input_delay -clock clk  0.1  [get_ports CNTR_pk_in_rdb_addr__2_]
set_input_delay -clock clk  0.1  [get_ports CNTR_pk_in_rdb_addr__1_]
set_input_delay -clock clk  0.1  [get_ports CNTR_pk_in_rdb_addr__0_]
set_output_delay -clock clk  0.1  [get_ports CNN_pk_out_3__PE_state__2_]
set_output_delay -clock clk  0.1  [get_ports CNN_pk_out_3__PE_state__1_]
set_output_delay -clock clk  0.1  [get_ports CNN_pk_out_3__PE_state__0_]
set_output_delay -clock clk  0.1  [get_ports CNN_pk_out_3__wrb_data__7_]
set_output_delay -clock clk  0.1  [get_ports CNN_pk_out_3__wrb_data__6_]
set_output_delay -clock clk  0.1  [get_ports CNN_pk_out_3__wrb_data__5_]
set_output_delay -clock clk  0.1  [get_ports CNN_pk_out_3__wrb_data__4_]
set_output_delay -clock clk  0.1  [get_ports CNN_pk_out_3__wrb_data__3_]
set_output_delay -clock clk  0.1  [get_ports CNN_pk_out_3__wrb_data__2_]
set_output_delay -clock clk  0.1  [get_ports CNN_pk_out_3__wrb_data__1_]
set_output_delay -clock clk  0.1  [get_ports CNN_pk_out_3__wrb_data__0_]
set_output_delay -clock clk  0.1  [get_ports CNN_pk_out_3__wrb_addr__3_]
set_output_delay -clock clk  0.1  [get_ports CNN_pk_out_3__wrb_addr__2_]
set_output_delay -clock clk  0.1  [get_ports CNN_pk_out_3__wrb_addr__1_]
set_output_delay -clock clk  0.1  [get_ports CNN_pk_out_3__wrb_addr__0_]
set_output_delay -clock clk  0.1  [get_ports CNN_pk_out_3__wrb__3_]
set_output_delay -clock clk  0.1  [get_ports CNN_pk_out_3__wrb__2_]
set_output_delay -clock clk  0.1  [get_ports CNN_pk_out_3__wrb__1_]
set_output_delay -clock clk  0.1  [get_ports CNN_pk_out_3__wrb__0_]
set_output_delay -clock clk  0.1  [get_ports CNN_pk_out_3__rdb_addr__3_]
set_output_delay -clock clk  0.1  [get_ports CNN_pk_out_3__rdb_addr__2_]
set_output_delay -clock clk  0.1  [get_ports CNN_pk_out_3__rdb_addr__1_]
set_output_delay -clock clk  0.1  [get_ports CNN_pk_out_3__rdb_addr__0_]
set_output_delay -clock clk  0.1  [get_ports CNN_pk_out_2__PE_state__2_]
set_output_delay -clock clk  0.1  [get_ports CNN_pk_out_2__PE_state__1_]
set_output_delay -clock clk  0.1  [get_ports CNN_pk_out_2__PE_state__0_]
set_output_delay -clock clk  0.1  [get_ports CNN_pk_out_2__wrb_data__7_]
set_output_delay -clock clk  0.1  [get_ports CNN_pk_out_2__wrb_data__6_]
set_output_delay -clock clk  0.1  [get_ports CNN_pk_out_2__wrb_data__5_]
set_output_delay -clock clk  0.1  [get_ports CNN_pk_out_2__wrb_data__4_]
set_output_delay -clock clk  0.1  [get_ports CNN_pk_out_2__wrb_data__3_]
set_output_delay -clock clk  0.1  [get_ports CNN_pk_out_2__wrb_data__2_]
set_output_delay -clock clk  0.1  [get_ports CNN_pk_out_2__wrb_data__1_]
set_output_delay -clock clk  0.1  [get_ports CNN_pk_out_2__wrb_data__0_]
set_output_delay -clock clk  0.1  [get_ports CNN_pk_out_2__wrb_addr__3_]
set_output_delay -clock clk  0.1  [get_ports CNN_pk_out_2__wrb_addr__2_]
set_output_delay -clock clk  0.1  [get_ports CNN_pk_out_2__wrb_addr__1_]
set_output_delay -clock clk  0.1  [get_ports CNN_pk_out_2__wrb_addr__0_]
set_output_delay -clock clk  0.1  [get_ports CNN_pk_out_2__wrb__3_]
set_output_delay -clock clk  0.1  [get_ports CNN_pk_out_2__wrb__2_]
set_output_delay -clock clk  0.1  [get_ports CNN_pk_out_2__wrb__1_]
set_output_delay -clock clk  0.1  [get_ports CNN_pk_out_2__wrb__0_]
set_output_delay -clock clk  0.1  [get_ports CNN_pk_out_2__rdb_addr__3_]
set_output_delay -clock clk  0.1  [get_ports CNN_pk_out_2__rdb_addr__2_]
set_output_delay -clock clk  0.1  [get_ports CNN_pk_out_2__rdb_addr__1_]
set_output_delay -clock clk  0.1  [get_ports CNN_pk_out_2__rdb_addr__0_]
set_output_delay -clock clk  0.1  [get_ports CNN_pk_out_1__PE_state__2_]
set_output_delay -clock clk  0.1  [get_ports CNN_pk_out_1__PE_state__1_]
set_output_delay -clock clk  0.1  [get_ports CNN_pk_out_1__PE_state__0_]
set_output_delay -clock clk  0.1  [get_ports CNN_pk_out_1__wrb_data__7_]
set_output_delay -clock clk  0.1  [get_ports CNN_pk_out_1__wrb_data__6_]
set_output_delay -clock clk  0.1  [get_ports CNN_pk_out_1__wrb_data__5_]
set_output_delay -clock clk  0.1  [get_ports CNN_pk_out_1__wrb_data__4_]
set_output_delay -clock clk  0.1  [get_ports CNN_pk_out_1__wrb_data__3_]
set_output_delay -clock clk  0.1  [get_ports CNN_pk_out_1__wrb_data__2_]
set_output_delay -clock clk  0.1  [get_ports CNN_pk_out_1__wrb_data__1_]
set_output_delay -clock clk  0.1  [get_ports CNN_pk_out_1__wrb_data__0_]
set_output_delay -clock clk  0.1  [get_ports CNN_pk_out_1__wrb_addr__3_]
set_output_delay -clock clk  0.1  [get_ports CNN_pk_out_1__wrb_addr__2_]
set_output_delay -clock clk  0.1  [get_ports CNN_pk_out_1__wrb_addr__1_]
set_output_delay -clock clk  0.1  [get_ports CNN_pk_out_1__wrb_addr__0_]
set_output_delay -clock clk  0.1  [get_ports CNN_pk_out_1__wrb__3_]
set_output_delay -clock clk  0.1  [get_ports CNN_pk_out_1__wrb__2_]
set_output_delay -clock clk  0.1  [get_ports CNN_pk_out_1__wrb__1_]
set_output_delay -clock clk  0.1  [get_ports CNN_pk_out_1__wrb__0_]
set_output_delay -clock clk  0.1  [get_ports CNN_pk_out_1__rdb_addr__3_]
set_output_delay -clock clk  0.1  [get_ports CNN_pk_out_1__rdb_addr__2_]
set_output_delay -clock clk  0.1  [get_ports CNN_pk_out_1__rdb_addr__1_]
set_output_delay -clock clk  0.1  [get_ports CNN_pk_out_1__rdb_addr__0_]
set_output_delay -clock clk  0.1  [get_ports CNN_pk_out_0__PE_state__2_]
set_output_delay -clock clk  0.1  [get_ports CNN_pk_out_0__PE_state__1_]
set_output_delay -clock clk  0.1  [get_ports CNN_pk_out_0__PE_state__0_]
set_output_delay -clock clk  0.1  [get_ports CNN_pk_out_0__wrb_data__7_]
set_output_delay -clock clk  0.1  [get_ports CNN_pk_out_0__wrb_data__6_]
set_output_delay -clock clk  0.1  [get_ports CNN_pk_out_0__wrb_data__5_]
set_output_delay -clock clk  0.1  [get_ports CNN_pk_out_0__wrb_data__4_]
set_output_delay -clock clk  0.1  [get_ports CNN_pk_out_0__wrb_data__3_]
set_output_delay -clock clk  0.1  [get_ports CNN_pk_out_0__wrb_data__2_]
set_output_delay -clock clk  0.1  [get_ports CNN_pk_out_0__wrb_data__1_]
set_output_delay -clock clk  0.1  [get_ports CNN_pk_out_0__wrb_data__0_]
set_output_delay -clock clk  0.1  [get_ports CNN_pk_out_0__wrb_addr__3_]
set_output_delay -clock clk  0.1  [get_ports CNN_pk_out_0__wrb_addr__2_]
set_output_delay -clock clk  0.1  [get_ports CNN_pk_out_0__wrb_addr__1_]
set_output_delay -clock clk  0.1  [get_ports CNN_pk_out_0__wrb_addr__0_]
set_output_delay -clock clk  0.1  [get_ports CNN_pk_out_0__wrb__3_]
set_output_delay -clock clk  0.1  [get_ports CNN_pk_out_0__wrb__2_]
set_output_delay -clock clk  0.1  [get_ports CNN_pk_out_0__wrb__1_]
set_output_delay -clock clk  0.1  [get_ports CNN_pk_out_0__wrb__0_]
set_output_delay -clock clk  0.1  [get_ports CNN_pk_out_0__rdb_addr__3_]
set_output_delay -clock clk  0.1  [get_ports CNN_pk_out_0__rdb_addr__2_]
set_output_delay -clock clk  0.1  [get_ports CNN_pk_out_0__rdb_addr__1_]
set_output_delay -clock clk  0.1  [get_ports CNN_pk_out_0__rdb_addr__0_]
