###################################################################

# Created by write_sdc on Thu Mar 30 17:52:52 2023

###################################################################
set sdc_version 2.1

set_units -time ns -resistance kOhm -capacitance pF -voltage V -current mA
set_operating_conditions typical -library typical
set_wire_load_mode segmented
set_wire_load_model -name ibm13_wl10 -library typical
set_max_fanout 16 [current_design]
set_driving_cell -lib_cell INVX2TR [get_ports clk]
set_driving_cell -lib_cell INVX2TR [get_ports reset]
set_driving_cell -lib_cell INVX2TR [get_ports pk_out_3__PE_state__2_]
set_driving_cell -lib_cell INVX2TR [get_ports pk_out_3__PE_state__1_]
set_driving_cell -lib_cell INVX2TR [get_ports pk_out_3__PE_state__0_]
set_driving_cell -lib_cell INVX2TR [get_ports pk_out_3__data__7_]
set_driving_cell -lib_cell INVX2TR [get_ports pk_out_3__data__6_]
set_driving_cell -lib_cell INVX2TR [get_ports pk_out_3__data__5_]
set_driving_cell -lib_cell INVX2TR [get_ports pk_out_3__data__4_]
set_driving_cell -lib_cell INVX2TR [get_ports pk_out_3__data__3_]
set_driving_cell -lib_cell INVX2TR [get_ports pk_out_3__data__2_]
set_driving_cell -lib_cell INVX2TR [get_ports pk_out_3__data__1_]
set_driving_cell -lib_cell INVX2TR [get_ports pk_out_3__data__0_]
set_driving_cell -lib_cell INVX2TR [get_ports pk_out_2__PE_state__2_]
set_driving_cell -lib_cell INVX2TR [get_ports pk_out_2__PE_state__1_]
set_driving_cell -lib_cell INVX2TR [get_ports pk_out_2__PE_state__0_]
set_driving_cell -lib_cell INVX2TR [get_ports pk_out_2__data__7_]
set_driving_cell -lib_cell INVX2TR [get_ports pk_out_2__data__6_]
set_driving_cell -lib_cell INVX2TR [get_ports pk_out_2__data__5_]
set_driving_cell -lib_cell INVX2TR [get_ports pk_out_2__data__4_]
set_driving_cell -lib_cell INVX2TR [get_ports pk_out_2__data__3_]
set_driving_cell -lib_cell INVX2TR [get_ports pk_out_2__data__2_]
set_driving_cell -lib_cell INVX2TR [get_ports pk_out_2__data__1_]
set_driving_cell -lib_cell INVX2TR [get_ports pk_out_2__data__0_]
set_driving_cell -lib_cell INVX2TR [get_ports pk_out_1__PE_state__2_]
set_driving_cell -lib_cell INVX2TR [get_ports pk_out_1__PE_state__1_]
set_driving_cell -lib_cell INVX2TR [get_ports pk_out_1__PE_state__0_]
set_driving_cell -lib_cell INVX2TR [get_ports pk_out_1__data__7_]
set_driving_cell -lib_cell INVX2TR [get_ports pk_out_1__data__6_]
set_driving_cell -lib_cell INVX2TR [get_ports pk_out_1__data__5_]
set_driving_cell -lib_cell INVX2TR [get_ports pk_out_1__data__4_]
set_driving_cell -lib_cell INVX2TR [get_ports pk_out_1__data__3_]
set_driving_cell -lib_cell INVX2TR [get_ports pk_out_1__data__2_]
set_driving_cell -lib_cell INVX2TR [get_ports pk_out_1__data__1_]
set_driving_cell -lib_cell INVX2TR [get_ports pk_out_1__data__0_]
set_driving_cell -lib_cell INVX2TR [get_ports pk_out_0__PE_state__2_]
set_driving_cell -lib_cell INVX2TR [get_ports pk_out_0__PE_state__1_]
set_driving_cell -lib_cell INVX2TR [get_ports pk_out_0__PE_state__0_]
set_driving_cell -lib_cell INVX2TR [get_ports pk_out_0__data__7_]
set_driving_cell -lib_cell INVX2TR [get_ports pk_out_0__data__6_]
set_driving_cell -lib_cell INVX2TR [get_ports pk_out_0__data__5_]
set_driving_cell -lib_cell INVX2TR [get_ports pk_out_0__data__4_]
set_driving_cell -lib_cell INVX2TR [get_ports pk_out_0__data__3_]
set_driving_cell -lib_cell INVX2TR [get_ports pk_out_0__data__2_]
set_driving_cell -lib_cell INVX2TR [get_ports pk_out_0__data__1_]
set_driving_cell -lib_cell INVX2TR [get_ports pk_out_0__data__0_]
set_load -pin_load 0.01 [get_ports DRAM_in3_WEN]
set_load -pin_load 0.01 [get_ports {DRAM_in3_Data[7]}]
set_load -pin_load 0.01 [get_ports {DRAM_in3_Data[6]}]
set_load -pin_load 0.01 [get_ports {DRAM_in3_Data[5]}]
set_load -pin_load 0.01 [get_ports {DRAM_in3_Data[4]}]
set_load -pin_load 0.01 [get_ports {DRAM_in3_Data[3]}]
set_load -pin_load 0.01 [get_ports {DRAM_in3_Data[2]}]
set_load -pin_load 0.01 [get_ports {DRAM_in3_Data[1]}]
set_load -pin_load 0.01 [get_ports {DRAM_in3_Data[0]}]
create_clock [get_ports clk]  -period 1.5  -waveform {0 0.75}
set_clock_uncertainty 0.1  [get_clocks clk]
set_clock_transition -min -fall 0.1 [get_clocks clk]
set_clock_transition -min -rise 0.1 [get_clocks clk]
set_clock_transition -max -fall 0.1 [get_clocks clk]
set_clock_transition -max -rise 0.1 [get_clocks clk]
set_input_delay -clock clk  0.1  [get_ports reset]
set_input_delay -clock clk  0.1  [get_ports pk_out_3__PE_state__2_]
set_input_delay -clock clk  0.1  [get_ports pk_out_3__PE_state__1_]
set_input_delay -clock clk  0.1  [get_ports pk_out_3__PE_state__0_]
set_input_delay -clock clk  0.1  [get_ports pk_out_3__data__7_]
set_input_delay -clock clk  0.1  [get_ports pk_out_3__data__6_]
set_input_delay -clock clk  0.1  [get_ports pk_out_3__data__5_]
set_input_delay -clock clk  0.1  [get_ports pk_out_3__data__4_]
set_input_delay -clock clk  0.1  [get_ports pk_out_3__data__3_]
set_input_delay -clock clk  0.1  [get_ports pk_out_3__data__2_]
set_input_delay -clock clk  0.1  [get_ports pk_out_3__data__1_]
set_input_delay -clock clk  0.1  [get_ports pk_out_3__data__0_]
set_input_delay -clock clk  0.1  [get_ports pk_out_2__PE_state__2_]
set_input_delay -clock clk  0.1  [get_ports pk_out_2__PE_state__1_]
set_input_delay -clock clk  0.1  [get_ports pk_out_2__PE_state__0_]
set_input_delay -clock clk  0.1  [get_ports pk_out_2__data__7_]
set_input_delay -clock clk  0.1  [get_ports pk_out_2__data__6_]
set_input_delay -clock clk  0.1  [get_ports pk_out_2__data__5_]
set_input_delay -clock clk  0.1  [get_ports pk_out_2__data__4_]
set_input_delay -clock clk  0.1  [get_ports pk_out_2__data__3_]
set_input_delay -clock clk  0.1  [get_ports pk_out_2__data__2_]
set_input_delay -clock clk  0.1  [get_ports pk_out_2__data__1_]
set_input_delay -clock clk  0.1  [get_ports pk_out_2__data__0_]
set_input_delay -clock clk  0.1  [get_ports pk_out_1__PE_state__2_]
set_input_delay -clock clk  0.1  [get_ports pk_out_1__PE_state__1_]
set_input_delay -clock clk  0.1  [get_ports pk_out_1__PE_state__0_]
set_input_delay -clock clk  0.1  [get_ports pk_out_1__data__7_]
set_input_delay -clock clk  0.1  [get_ports pk_out_1__data__6_]
set_input_delay -clock clk  0.1  [get_ports pk_out_1__data__5_]
set_input_delay -clock clk  0.1  [get_ports pk_out_1__data__4_]
set_input_delay -clock clk  0.1  [get_ports pk_out_1__data__3_]
set_input_delay -clock clk  0.1  [get_ports pk_out_1__data__2_]
set_input_delay -clock clk  0.1  [get_ports pk_out_1__data__1_]
set_input_delay -clock clk  0.1  [get_ports pk_out_1__data__0_]
set_input_delay -clock clk  0.1  [get_ports pk_out_0__PE_state__2_]
set_input_delay -clock clk  0.1  [get_ports pk_out_0__PE_state__1_]
set_input_delay -clock clk  0.1  [get_ports pk_out_0__PE_state__0_]
set_input_delay -clock clk  0.1  [get_ports pk_out_0__data__7_]
set_input_delay -clock clk  0.1  [get_ports pk_out_0__data__6_]
set_input_delay -clock clk  0.1  [get_ports pk_out_0__data__5_]
set_input_delay -clock clk  0.1  [get_ports pk_out_0__data__4_]
set_input_delay -clock clk  0.1  [get_ports pk_out_0__data__3_]
set_input_delay -clock clk  0.1  [get_ports pk_out_0__data__2_]
set_input_delay -clock clk  0.1  [get_ports pk_out_0__data__1_]
set_input_delay -clock clk  0.1  [get_ports pk_out_0__data__0_]
set_output_delay -clock clk  0.1  [get_ports DRAM_in3_WEN]
set_output_delay -clock clk  0.1  [get_ports {DRAM_in3_Data[7]}]
set_output_delay -clock clk  0.1  [get_ports {DRAM_in3_Data[6]}]
set_output_delay -clock clk  0.1  [get_ports {DRAM_in3_Data[5]}]
set_output_delay -clock clk  0.1  [get_ports {DRAM_in3_Data[4]}]
set_output_delay -clock clk  0.1  [get_ports {DRAM_in3_Data[3]}]
set_output_delay -clock clk  0.1  [get_ports {DRAM_in3_Data[2]}]
set_output_delay -clock clk  0.1  [get_ports {DRAM_in3_Data[1]}]
set_output_delay -clock clk  0.1  [get_ports {DRAM_in3_Data[0]}]
